Tekla Open API Reference for Tekla Structures 2025
BoltGroup.PartToBoltTo Property
 The part to bolt to.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Part PartToBoltTo { get; set; }
Public Property PartToBoltTo As Part
	Get
	Set
Property Value
Type: Part
See Also
Reference
BoltGroup Class
Tekla.Structures.Model Namespace